GitConverter/src/Enums/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсии</name>
  <enumValues>
    <name>ПолучаетсяCF</name>
  </enumValues>
  <enumValues>
    <name>ПолученCF</name>
  </enumValues>
  <enumValues>
    <name>ВыгружаетсяВXML</name>
  </enumValues>
  <enumValues>
    <name>ВыгруженаВXML</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяВEDT</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженаВEDT</name>
  </enumValues>
  <enumValues>
    <name>ПомещаетсяВGit</name>
  </enumValues>
  <enumValues>
    <name>ПомещенаВGit</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Enums/СостоянияВерсии/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает префикс для имен файлов в зависимости от состояния версии.
//
// Параметры:
//   Состояние - ПеречислениеСсылка.СостоянияВерсии
//
// Возвращаемое значение:
//   Строка - Префикс.
//
Функция ПрефиксИмениФайла(Состояние) Экспорт
	Если Состояние = ПолучаетсяCF
		Или Состояние = ПолученCF Тогда
		Возврат "ПолучениеCF";
	ИначеЕсли Состояние = ВыгружаетсяВXML
		Или Состояние = ВыгруженаВXML Тогда
		Возврат "ВыгрузкаВXML";
	ИначеЕсли Состояние = ЗагружаетсяВEDT
		Или Состояние = ЗагруженаВEDT Тогда
		Возврат "ЗагрузкаВEDT";
	ИначеЕсли Состояние = ПомещаетсяВGit
		Или Состояние = ПомещенаВGit Тогда
		Возврат "КоммитВGIT";
	Иначе
		Возврат Строка(Состояние);
	КонецЕсли;
КонецФункции

Функция СостоянияВКоторыхЕстьXML() Экспорт
	Результат = Новый Массив;
	Результат.Добавить(ВыгруженаВXML);
	Результат.Добавить(ЗагружаетсяВEDT);
	Результат.Добавить(ЗагруженаВEDT);
	Результат.Добавить(ПомещаетсяВGit);
	Результат.Добавить(ПомещенаВGit);
	Возврат Результат;
КонецФункции

Функция СостоянияПриНачалеОпераций() Экспорт
	Результат = Новый Массив;
	Результат.Добавить(ПолучаетсяCF);
	Результат.Добавить(ВыгружаетсяВXML);
	Результат.Добавить(ЗагружаетсяВEDT);
	Результат.Добавить(ПомещаетсяВGit);
	Возврат Результат;
КонецФункции

Функция ПорядокСостояний() Экспорт
	Результат = Новый Соответствие;
	Результат.Вставить(ПустаяСсылка(), 0);
	Результат.Вставить(ПолучаетсяCF, 1);
	Результат.Вставить(ПолученCF, 2);
	Результат.Вставить(ВыгружаетсяВXML, 3);
	Результат.Вставить(ВыгруженаВXML, 4);
	Результат.Вставить(ЗагружаетсяВEDT, 5);
	Результат.Вставить(ЗагруженаВEDT, 6);
	Результат.Вставить(ПомещаетсяВGit, 7);
	Результат.Вставить(ПомещенаВGit, 8);
	Возврат Результат;
КонецФункции

#КонецОбласти
